app/controllers/categories_controller.rb

SELECT * FROM `categories`
---
  def index
    @categories = Category.all

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO `categories` (`created_at`, `category_name`, `updated_at`, `user_id`) VALUES('2010-10-14 11:32:26', 'aaaaaaaaaa', '2010-10-14 11:32:26', 1)
---
  def create
    @category = Category.new(params[:category])
    @category.user_id = current_user.id

    respond_to do |format|
      if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def update
    @category = Category.find(params[:id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
DELETE FROM `categories` WHERE `id` = 1
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy