app/controllers/checked_status_controller.rb

  def change
    @tasks = Task.find(params[:task_id])
    @tasks.status ="finished"
    @tasks.save
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 70332978449180)
UPDATE `tasks` SET `status` = 'finished', `updated_at` = '2010-10-15 07:57:06' WHERE `id` = 10