app/controllers/salesforce_controller.rb

UPDATE `users` SET `updated_at` = '2010-10-22 18:06:51', `request_token` = '00D20000000OIfH!AR4AQFcc_DfqfIGA8F3H6AqHdWgLMHtIoFbmEt31F8t3PD8fQxew.X0wGFhs_HPa850aT94zN2E2.y5Mqa6FH0mZA6uIQQWj' WHERE `id` = 3
---
  def index
    request_token = params["code"]
    http = Net::HTTP.new('login.salesforce.com', 443)
    http.verify_mode = OpenSSL::SSL::VERIFY_NONE
    http.use_ssl = true
    data = "grant_type=authorization_code&client_id=#{CONSUMER_KEY}&client_secret=#{CONSUMER_SECRET}&redirect_uri=#{CALLBACK_URL}&code=#{request_token}"
    path = "/services/oauth2/token"
    headers = {
            'Referer' => 'https://emea.salesforce.com/services/oauth2/token',
            'Content-Type' => 'application/x-www-form-urlencoded'
    }
    resp, data = http.post(path, data, headers)

    result = JSON.parse(data)
    access_token = result["access_token"]
    current_user.request_token = access_token
    current_user.save