app/controllers/salesforces_controller.rb

SELECT * FROM `salesforces` WHERE (`salesforces`.`id` = 0)
---
  def show
    @salesforce = Salesforce.find(params[:id])