app/controllers/tasks_controller.rb

  def edit
    @categories = Category.all
---
SELECT * FROM `categories`