app/controllers/tasks_controller.rb

  def index
    @categories =current_user.categories
    if params[:category_id]
#      @task=Task.find(params[:category_id])
      @task =current_user.tasks.find_all_by_category_id(params[:category_id])
    end
    if params[:category_id] == "all"
#      @task=Task.all
      @task =Task.all
    end
    unless params[:category_id]
       @task=Task.all
    end

#      @tasks_finished = current_user.finished_tasks
#      @tasks_started = current_user.started_tasks
#    @tasks_finished = @task.find_all_by_status("finished")
#    @tasks_started = @task.find_all_by_status(["started", "new"])
    @tasks_finished = @task.find_all_by_status( "finished")
---
SELECT * FROM `tasks` WHERE (`tasks`.user_id = 1) AND (((status != 'finished') AND (`tasks`.`category_id` = '1')) AND (`tasks`.user_id = 1))
SELECT * FROM `categories` WHERE (`categories`.`user_id` = 3)
SELECT * FROM `tasks` WHERE (`tasks`.user_id = 1) AND ((status != 'finished') AND (`tasks`.user_id = 1))
SELECT * FROM `tasks` WHERE (`tasks`.user_id = 1) AND (((`tasks`.`status` = 'finished' AND `tasks`.`category_id` = '1')) AND (`tasks`.user_id = 1))

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 0)

  def new
    @task = Task.new
    @categories = Category.all
---
SELECT * FROM `categories`

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 9)

  def create
    @task = Task.new(params[:task])
    @task.user_id = current_user.id
    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`status`, `updated_at`, `title`, `description`, `category_id`, `user_id`, `created_at`) VALUES('started', '2010-10-15 08:07:21', 'ghfjv', 'vcxn,bvcxb', 2, 1, '2010-10-15 08:07:21')

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 10)
UPDATE `tasks` SET `status` = 'started', `description` = '21321312', `updated_at` = '2010-10-12 11:03:12' WHERE `id` = 10

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
DELETE FROM `tasks` WHERE `id` = 1