app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `lastname`, `firstname`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '28256a24b88f132aa9c9e07df47c21459b30d81b', '2010-10-12 07:29:50', NULL, '5498f10252be5bf161dd03deb9f54b53bc1beab1', NULL, '77ccfa55c6e4154d96e45b30e7dcd12202233255', 'PawkaaAA', 'PawkaaAA', NULL, 'pawkaaaa', 'dysia_kapysia@mail.ru', '2010-10-12 07:29:50')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

UPDATE `users` SET `email` = 'params@bk.com', `updated_at` = '2010-10-11 10:10:12' WHERE `id` = 3
---
  def update
    @user = current_user
    @user.update_attributes(params['user'])

SELECT * FROM `users` WHERE (`users`.`activation_code` = '6e1103f735261915a5d319bdadc38dfdf0b3292f') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?